FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20j18.h
#define PINMUX_PA24D_SERCOM5_PAD2    ( ( PIN_PA24D_SERCOM5_PAD2 << 16 ) | MUX_PA24D_SERCOM5_PAD2 )
#define PORT_PA24D_SERCOM5_PAD2      ( 1u << 24 )
#define PIN_PB00D_SERCOM5_PAD2       32       /**< \brief SERCOM5 signal: PAD2 on PB00 mux D */
#define MUX_PB00D_SERCOM5_PAD2       3
#define PINMUX_PB00D_SERCOM5_PAD2    ( ( PIN_PB00D_SERCOM5_PAD2 << 16 ) | MUX_PB00D_SERCOM5_PAD2 )
#define PORT_PB00D_SERCOM5_PAD2      ( 1u << 0 )
#define PIN_PB22D_SERCOM5_PAD2       54       /**< \brief SERCOM5 signal: PAD2 on PB22 mux D */
#define MUX_PB22D_SERCOM5_PAD2       3
#define PINMUX_PB22D_SERCOM5_PAD2    ( ( PIN_PB22D_SERCOM5_PAD2 << 16 ) | MUX_PB22D_SERCOM5_PAD2 )
#define PORT_PB22D_SERCOM5_PAD2      ( 1u << 22 )
#define PIN_PA20C_SERCOM5_PAD2       20       /**< \brief SERCOM5 signal: PAD2 on PA20 mux C */
#define MUX_PA20C_SERCOM5_PAD2       2
#define PINMUX_PA20C_SERCOM5_PAD2    ( ( PIN_PA20C_SERCOM5_PAD2 << 16 ) | MUX_PA20C_SERCOM5_PAD2 )
#define PORT_PA20C_SERCOM5_PAD2      ( 1u << 20 )
#define PIN_PA25D_SERCOM5_PAD3       25       /**< \brief SERCOM5 signal: PAD3 on PA25 mux D */
#define MUX_PA25D_SERCOM5_PAD3       3
#define PINMUX_PA25D_SERCOM5_PAD3    ( ( PIN_PA25D_SERCOM5_PAD3 << 16 ) | MUX_PA25D_SERCOM5_PAD3 )
#define PORT_PA25D_SERCOM5_PAD3      ( 1u << 25 )
#define PIN_PB01D_SERCOM5_PAD3       33       /**< \brief SERCOM5 signal: PAD3 on PB01 mux D */
#define MUX_PB01D_SERCOM5_PAD3       3
#define PINMUX_PB01D_SERCOM5_PAD3    ( ( PIN_PB01D_SERCOM5_PAD3 << 16 ) | MUX_PB01D_SERCOM5_PAD3 )
#define PORT_PB01D_SERCOM5_PAD3      ( 1u << 1 )
#define PIN_PB23D_SERCOM5_PAD3       55       /**< \brief SERCOM5 signal: PAD3 on PB23 mux D */
#define MUX_PB23D_SERCOM5_PAD3       3
#define PINMUX_PB23D_SERCOM5_PAD3    ( ( PIN_PB23D_SERCOM5_PAD3 << 16 ) | MUX_PB23D_SERCOM5_PAD3 )
#define PORT_PB23D_SERCOM5_PAD3      ( 1u << 23 )
#define PIN_PA21C_SERCOM5_PAD3       21       /**< \brief SERCOM5 signal: PAD3 on PA21 mux C */
#define MUX_PA21C_SERCOM5_PAD3       2
#define PINMUX_PA21C_SERCOM5_PAD3    ( ( PIN_PA21C_SERCOM5_PAD3 << 16 ) | MUX_PA21C_SERCOM5_PAD3 )
#define PORT_PA21C_SERCOM5_PAD3      ( 1u << 21 )
/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_PA04F_TC0_WO0            4        /**< \brief TC0 signal: WO0 on PA04 mux F */
#define MUX_PA04F_TC0_WO0            5
#define PINMUX_PA04F_TC0_WO0         ( ( PIN_PA04F_TC0_WO0 << 16 ) | MUX_PA04F_TC0_WO0 )
#define PORT_PA04F_TC0_WO0           ( 1u << 4 )
#define PIN_PB30F_TC0_WO0            62       /**< \brief TC0 signal: WO0 on PB30 mux F */
#define MUX_PB30F_TC0_WO0            5
#define PINMUX_PB30F_TC0_WO0         ( ( PIN_PB30F_TC0_WO0 << 16 ) | MUX_PB30F_TC0_WO0 )
#define PORT_PB30F_TC0_WO0           ( 1u << 30 )
#define PIN_PA08E_TC0_WO0            8        /**< \brief TC0 signal: WO0 on PA08 mux E */
#define MUX_PA08E_TC0_WO0            4
#define PINMUX_PA08E_TC0_WO0         ( ( PIN_PA08E_TC0_WO0 << 16 ) | MUX_PA08E_TC0_WO0 )
#define PORT_PA08E_TC0_WO0           ( 1u << 8 )
#define PIN_PA05F_TC0_WO1            5        /**< \brief TC0 signal: WO1 on PA05 mux F */
#define MUX_PA05F_TC0_WO1            5
#define PINMUX_PA05F_TC0_WO1         ( ( PIN_PA05F_TC0_WO1 << 16 ) | MUX_PA05F_TC0_WO1 )
#define PORT_PA05F_TC0_WO1           ( 1u << 5 )
#define PIN_PB31F_TC0_WO1            63       /**< \brief TC0 signal: WO1 on PB31 mux F */
#define MUX_PB31F_TC0_WO1            5
#define PINMUX_PB31F_TC0_WO1         ( ( PIN_PB31F_TC0_WO1 << 16 ) | MUX_PB31F_TC0_WO1 )
#define PORT_PB31F_TC0_WO1           ( 1u << 31 )
#define PIN_PA09E_TC0_WO1            9        /**< \brief TC0 signal: WO1 on PA09 mux E */
#define MUX_PA09E_TC0_WO1            4
#define PINMUX_PA09E_TC0_WO1         ( ( PIN_PA09E_TC0_WO1 << 16 ) | MUX_PA09E_TC0_WO1 )
#define PORT_PA09E_TC0_WO1           ( 1u << 9 )
/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA06F_TC1_WO0            6        /**< \brief TC1 signal: WO0 on PA06 mux F */
#define MUX_PA06F_TC1_WO0            5
#define PINMUX_PA06F_TC1_WO0         ( ( PIN_PA06F_TC1_WO0 << 16 ) | MUX_PA06F_TC1_WO0 )
#define PORT_PA06F_TC1_WO0           ( 1u << 6 )
#define PIN_PA30F_TC1_WO0            30       /**< \brief TC1 signal: WO0 on PA30 mux F */
#define MUX_PA30F_TC1_WO0            5
#define PINMUX_PA30F_TC1_WO0         ( ( PIN_PA30F_TC1_WO0 << 16 ) | MUX_PA30F_TC1_WO0 )
#define PORT_PA30F_TC1_WO0           ( 1u << 30 )
#define PIN_PA10E_TC1_WO0            10       /**< \brief TC1 signal: WO0 on PA10 mux E */
#define MUX_PA10E_TC1_WO0            4
#define PINMUX_PA10E_TC1_WO0         ( ( PIN_PA10E_TC1_WO0 << 16 ) | MUX_PA10E_TC1_WO0 )
#define PORT_PA10E_TC1_WO0           ( 1u << 10 )
#define PIN_PA07F_TC1_WO1            7        /**< \brief TC1 signal: WO1 on PA07 mux F */
#define MUX_PA07F_TC1_WO1            5
#define PINMUX_PA07F_TC1_WO1         ( ( PIN_PA07F_TC1_WO1 << 16 ) | MUX_PA07F_TC1_WO1 )
#define PORT_PA07F_TC1_WO1           ( 1u << 7 )
#define PIN_PA31F_TC1_WO1            31       /**< \brief TC1 signal: WO1 on PA31 mux F */
#define MUX_PA31F_TC1_WO1            5
#define PINMUX_PA31F_TC1_WO1         ( ( PIN_PA31F_TC1_WO1 << 16 ) | MUX_PA31F_TC1_WO1 )
#define PORT_PA31F_TC1_WO1           ( 1u << 31 )
#define PIN_PA11E_TC1_WO1            11       /**< \brief TC1 signal: WO1 on PA11 mux E */
#define MUX_PA11E_TC1_WO1            4
#define PINMUX_PA11E_TC1_WO1         ( ( PIN_PA11E_TC1_WO1 << 16 ) | MUX_PA11E_TC1_WO1 )
#define PORT_PA11E_TC1_WO1           ( 1u << 11 )
/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_PA16F_TC2_WO0            16       /**< \brief TC2 signal: WO0 on PA16 mux F */
#define MUX_PA16F_TC2_WO0            5
#define PINMUX_PA16F_TC2_WO0         ( ( PIN_PA16F_TC2_WO0 << 16 ) | MUX_PA16F_TC2_WO0 )
#define PORT_PA16F_TC2_WO0           ( 1u << 16 )
#define PIN_PA12E_TC2_WO0            12       /**< \brief TC2 signal: WO0 on PA12 mux E */
#define MUX_PA12E_TC2_WO0            4
#define PINMUX_PA12E_TC2_WO0         ( ( PIN_PA12E_TC2_WO0 << 16 ) | MUX_PA12E_TC2_WO0 )
#define PORT_PA12E_TC2_WO0           ( 1u << 12 )
#define PIN_PA00F_TC2_WO0            0        /**< \brief TC2 signal: WO0 on PA00 mux F */
#define MUX_PA00F_TC2_WO0            5
#define PINMUX_PA00F_TC2_WO0         ( ( PIN_PA00F_TC2_WO0 << 16 ) | MUX_PA00F_TC2_WO0 )
#define PORT_PA00F_TC2_WO0           ( 1u << 0 )
#define PIN_PA17F_TC2_WO1            17       /**< \brief TC2 signal: WO1 on PA17 mux F */
#define MUX_PA17F_TC2_WO1            5
#define PINMUX_PA17F_TC2_WO1         ( ( PIN_PA17F_TC2_WO1 << 16 ) | MUX_PA17F_TC2_WO1 )
#define PORT_PA17F_TC2_WO1           ( 1u << 17 )
#define PIN_PA13E_TC2_WO1            13       /**< \brief TC2 signal: WO1 on PA13 mux E */
#define MUX_PA13E_TC2_WO1            4
#define PINMUX_PA13E_TC2_WO1         ( ( PIN_PA13E_TC2_WO1 << 16 ) | MUX_PA13E_TC2_WO1 )
#define PORT_PA13E_TC2_WO1           ( 1u << 13 )
#define PIN_PA01F_TC2_WO1            1        /**< \brief TC2 signal: WO1 on PA01 mux F */
#define MUX_PA01F_TC2_WO1            5
#define PINMUX_PA01F_TC2_WO1         ( ( PIN_PA01F_TC2_WO1 << 16 ) | MUX_PA01F_TC2_WO1 )
#define PORT_PA01F_TC2_WO1           ( 1u << 1 )
/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA18F_TC3_WO0            18       /**< \brief TC3 signal: WO0 on PA18 mux F */
#define MUX_PA18F_TC3_WO0            5
#define PINMUX_PA18F_TC3_WO0         ( ( PIN_PA18F_TC3_WO0 << 16 ) | MUX_PA18F_TC3_WO0 )
#define PORT_PA18F_TC3_WO0           ( 1u << 18 )
#define PIN_PA14E_TC3_WO0            14       /**< \brief TC3 signal: WO0 on PA14 mux E */
#define MUX_PA14E_TC3_WO0            4
#define PINMUX_PA14E_TC3_WO0         ( ( PIN_PA14E_TC3_WO0 << 16 ) | MUX_PA14E_TC3_WO0 )
#define PORT_PA14E_TC3_WO0           ( 1u << 14 )
#define PIN_PA19F_TC3_WO1            19       /**< \brief TC3 signal: WO1 on PA19 mux F */
#define MUX_PA19F_TC3_WO1            5
#define PINMUX_PA19F_TC3_WO1         ( ( PIN_PA19F_TC3_WO1 << 16 ) | MUX_PA19F_TC3_WO1 )
#define PORT_PA19F_TC3_WO1           ( 1u << 19 )
#define PIN_PA15E_TC3_WO1            15       /**< \brief TC3 signal: WO1 on PA15 mux E */
#define MUX_PA15E_TC3_WO1            4
#define PINMUX_PA15E_TC3_WO1         ( ( PIN_PA15E_TC3_WO1 << 16 ) | MUX_PA15E_TC3_WO1 )
#define PORT_PA15E_TC3_WO1           ( 1u << 15 )
/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PA22F_TC4_WO0            22       /**< \brief TC4 signal: WO0 on PA22 mux F */
#define MUX_PA22F_TC4_WO0            5
#define PINMUX_PA22F_TC4_WO0         ( ( PIN_PA22F_TC4_WO0 << 16 ) | MUX_PA22F_TC4_WO0 )
#define PORT_PA22F_TC4_WO0           ( 1u << 22 )
#define PIN_PB08F_TC4_WO0            40       /**< \brief TC4 signal: WO0 on PB08 mux F */
#define MUX_PB08F_TC4_WO0            5
#define PINMUX_PB08F_TC4_WO0         ( ( PIN_PB08F_TC4_WO0 << 16 ) | MUX_PB08F_TC4_WO0 )
#define PORT_PB08F_TC4_WO0           ( 1u << 8 )
#define PIN_PB12E_TC4_WO0            44       /**< \brief TC4 signal: WO0 on PB12 mux E */
#define MUX_PB12E_TC4_WO0            4
#define PINMUX_PB12E_TC4_WO0         ( ( PIN_PB12E_TC4_WO0 << 16 ) | MUX_PB12E_TC4_WO0 )
#define PORT_PB12E_TC4_WO0           ( 1u << 12 )
#define PIN_PA23F_TC4_WO1            23       /**< \brief TC4 signal: WO1 on PA23 mux F */
#define MUX_PA23F_TC4_WO1            5
#define PINMUX_PA23F_TC4_WO1         ( ( PIN_PA23F_TC4_WO1 << 16 ) | MUX_PA23F_TC4_WO1 )
#define PORT_PA23F_TC4_WO1           ( 1u << 23 )
#define PIN_PB09F_TC4_WO1            41       /**< \brief TC4 signal: WO1 on PB09 mux F */
#define MUX_PB09F_TC4_WO1            5
#define PINMUX_PB09F_TC4_WO1         ( ( PIN_PB09F_TC4_WO1 << 16 ) | MUX_PB09F_TC4_WO1 )
#define PORT_PB09F_TC4_WO1           ( 1u << 9 )
#define PIN_PB13E_TC4_WO1            45       /**< \brief TC4 signal: WO1 on PB13 mux E */
#define MUX_PB13E_TC4_WO1            4
#define PINMUX_PB13E_TC4_WO1         ( ( PIN_PB13E_TC4_WO1 << 16 ) | MUX_PB13E_TC4_WO1 )
#define PORT_PB13E_TC4_WO1           ( 1u << 13 )
/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PA24F_TC5_WO0            24       /**< \brief TC5 signal: WO0 on PA24 mux F */
#define MUX_PA24F_TC5_WO0            5
#define PINMUX_PA24F_TC5_WO0         ( ( PIN_PA24F_TC5_WO0 << 16 ) | MUX_PA24F_TC5_WO0 )
#define PORT_PA24F_TC5_WO0           ( 1u << 24 )
#define PIN_PB10F_TC5_WO0            42       /**< \brief TC5 signal: WO0 on PB10 mux F */
#define MUX_PB10F_TC5_WO0            5
#define PINMUX_PB10F_TC5_WO0         ( ( PIN_PB10F_TC5_WO0 << 16 ) | MUX_PB10F_TC5_WO0 )
#define PORT_PB10F_TC5_WO0           ( 1u << 10 )
#define PIN_PB14E_TC5_WO0            46       /**< \brief TC5 signal: WO0 on PB14 mux E */
#define MUX_PB14E_TC5_WO0            4
#define PINMUX_PB14E_TC5_WO0         ( ( PIN_PB14E_TC5_WO0 << 16 ) | MUX_PB14E_TC5_WO0 )
#define PORT_PB14E_TC5_WO0           ( 1u << 14 )
#define PIN_PA25F_TC5_WO1            25       /**< \brief TC5 signal: WO1 on PA25 mux F */
#define MUX_PA25F_TC5_WO1            5
#define PINMUX_PA25F_TC5_WO1         ( ( PIN_PA25F_TC5_WO1 << 16 ) | MUX_PA25F_TC5_WO1 )
#define PORT_PA25F_TC5_WO1           ( 1u << 25 )
#define PIN_PB11F_TC5_WO1            43       /**< \brief TC5 signal: WO1 on PB11 mux F */
#define MUX_PB11F_TC5_WO1            5
#define PINMUX_PB11F_TC5_WO1         ( ( PIN_PB11F_TC5_WO1 << 16 ) | MUX_PB11F_TC5_WO1 )
#define PORT_PB11F_TC5_WO1           ( 1u << 11 )
#define PIN_PB15E_TC5_WO1            47       /**< \brief TC5 signal: WO1 on PB15 mux E */
#define MUX_PB15E_TC5_WO1            4
#define PINMUX_PB15E_TC5_WO1         ( ( PIN_PB15E_TC5_WO1 << 16 ) | MUX_PB15E_TC5_WO1 )
#define PORT_PB15E_TC5_WO1           ( 1u << 15 )
/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PB02F_TC6_WO0            34       /**< \brief TC6 signal: WO0 on PB02 mux F */
#define MUX_PB02F_TC6_WO0            5
#define PINMUX_PB02F_TC6_WO0         ( ( PIN_PB02F_TC6_WO0 << 16 ) | MUX_PB02F_TC6_WO0 )
#define PORT_PB02F_TC6_WO0           ( 1u << 2 )
#define PIN_PB16E_TC6_WO0            48       /**< \brief TC6 signal: WO0 on PB16 mux E */
#define MUX_PB16E_TC6_WO0            4
#define PINMUX_PB16E_TC6_WO0         ( ( PIN_PB16E_TC6_WO0 << 16 ) | MUX_PB16E_TC6_WO0 )
#define PORT_PB16E_TC6_WO0           ( 1u << 16 )
#define PIN_PB03F_TC6_WO1            35       /**< \brief TC6 signal: WO1 on PB03 mux F */
#define MUX_PB03F_TC6_WO1            5
#define PINMUX_PB03F_TC6_WO1         ( ( PIN_PB03F_TC6_WO1 << 16 ) | MUX_PB03F_TC6_WO1 )
#define PORT_PB03F_TC6_WO1           ( 1u << 3 )
#define PIN_PB17E_TC6_WO1            49       /**< \brief TC6 signal: WO1 on PB17 mux E */
#define MUX_PB17E_TC6_WO1            4
#define PINMUX_PB17E_TC6_WO1         ( ( PIN_PB17E_TC6_WO1 << 16 ) | MUX_PB17E_TC6_WO1 )
#define PORT_PB17E_TC6_WO1           ( 1u << 17 )
/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PB00F_TC7_WO0            32       /**< \brief TC7 signal: WO0 on PB00 mux F */
#define MUX_PB00F_TC7_WO0            5
#define PINMUX_PB00F_TC7_WO0         ( ( PIN_PB00F_TC7_WO0 << 16 ) | MUX_PB00F_TC7_WO0 )
#define PORT_PB00F_TC7_WO0           ( 1u << 0 )
#define PIN_PB22F_TC7_WO0            54       /**< \brief TC7 signal: WO0 on PB22 mux F */
#define MUX_PB22F_TC7_WO0            5
#define PINMUX_PB22F_TC7_WO0         ( ( PIN_PB22F_TC7_WO0 << 16 ) | MUX_PB22F_TC7_WO0 )
#define PORT_PB22F_TC7_WO0           ( 1u << 22 )
#define PIN_PA20E_TC7_WO0            20       /**< \brief TC7 signal: WO0 on PA20 mux E */
#define MUX_PA20E_TC7_WO0            4
#define PINMUX_PA20E_TC7_WO0         ( ( PIN_PA20E_TC7_WO0 << 16 ) | MUX_PA20E_TC7_WO0 )
#define PORT_PA20E_TC7_WO0           ( 1u << 20 )
#define PIN_PB01F_TC7_WO1            33       /**< \brief TC7 signal: WO1 on PB01 mux F */
#define MUX_PB01F_TC7_WO1            5
#define PINMUX_PB01F_TC7_WO1         ( ( PIN_PB01F_TC7_WO1 << 16 ) | MUX_PB01F_TC7_WO1 )
#define PORT_PB01F_TC7_WO1           ( 1u << 1 )
#define PIN_PB23F_TC7_WO1            55       /**< \brief TC7 signal: WO1 on PB23 mux F */
#define MUX_PB23F_TC7_WO1            5
#define PINMUX_PB23F_TC7_WO1         ( ( PIN_PB23F_TC7_WO1 << 16 ) | MUX_PB23F_TC7_WO1 )
#define PORT_PB23F_TC7_WO1           ( 1u << 23 )
#define PIN_PA21E_TC7_WO1            21       /**< \brief TC7 signal: WO1 on PA21 mux E */
#define MUX_PA21E_TC7_WO1            4
#define PINMUX_PA21E_TC7_WO1         ( ( PIN_PA21E_TC7_WO1 << 16 ) | MUX_PA21E_TC7_WO1 )
#define PORT_PA21E_TC7_WO1           ( 1u << 21 )
/* ========== PORT definition for ADC peripheral ========== */
#define PIN_PA02B_ADC_AIN0           2        /**< \brief ADC signal: AIN0 on PA02 mux B */
#define MUX_PA02B_ADC_AIN0           1
#define PINMUX_PA02B_ADC_AIN0        ( ( PIN_PA02B_ADC_AIN0 << 16 ) | MUX_PA02B_ADC_AIN0 )
#define PORT_PA02B_ADC_AIN0          ( 1u << 2 )
#define PIN_PA03B_ADC_AIN1           3        /**< \brief ADC signal: AIN1 on PA03 mux B */
#define MUX_PA03B_ADC_AIN1           1
#define PINMUX_PA03B_ADC_AIN1        ( ( PIN_PA03B_ADC_AIN1 << 16 ) | MUX_PA03B_ADC_AIN1 )
#define PORT_PA03B_ADC_AIN1          ( 1u << 3 )
#define PIN_PB08B_ADC_AIN2           40       /**< \brief ADC signal: AIN2 on PB08 mux B */
#define MUX_PB08B_ADC_AIN2           1
#define PINMUX_PB08B_ADC_AIN2        ( ( PIN_PB08B_ADC_AIN2 << 16 ) | MUX_PB08B_ADC_AIN2 )
#define PORT_PB08B_ADC_AIN2          ( 1u << 8 )
#define PIN_PB09B_ADC_AIN3           41       /**< \brief ADC signal: AIN3 on PB09 mux B */
#define MUX_PB09B_ADC_AIN3           1
#define PINMUX_PB09B_ADC_AIN3        ( ( PIN_PB09B_ADC_AIN3 << 16 ) | MUX_PB09B_ADC_AIN3 )
#define PORT_PB09B_ADC_AIN3          ( 1u << 9 )
#define PIN_PA04B_ADC_AIN4           4        /**< \brief ADC signal: AIN4 on PA04 mux B */
#define MUX_PA04B_ADC_AIN4           1
#define PINMUX_PA04B_ADC_AIN4        ( ( PIN_PA04B_ADC_AIN4 << 16 ) | MUX_PA04B_ADC_AIN4 )
#define PORT_PA04B_ADC_AIN4          ( 1u << 4 )
#define PIN_PA05B_ADC_AIN5           5        /**< \brief ADC signal: AIN5 on PA05 mux B */
#define MUX_PA05B_ADC_AIN5           1
#define PINMUX_PA05B_ADC_AIN5        ( ( PIN_PA05B_ADC_AIN5 << 16 ) | MUX_PA05B_ADC_AIN5 )
#define PORT_PA05B_ADC_AIN5          ( 1u << 5 )
#define PIN_PA06B_ADC_AIN6           6        /**< \brief ADC signal: AIN6 on PA06 mux B */
#define MUX_PA06B_ADC_AIN6           1
#define PINMUX_PA06B_ADC_AIN6        ( ( PIN_PA06B_ADC_AIN6 << 16 ) | MUX_PA06B_ADC_AIN6 )
#define PORT_PA06B_ADC_AIN6          ( 1u << 6 )
#define PIN_PA07B_ADC_AIN7           7        /**< \brief ADC signal: AIN7 on PA07 mux B */
#define MUX_PA07B_ADC_AIN7           1
#define PINMUX_PA07B_ADC_AIN7        ( ( PIN_PA07B_ADC_AIN7 << 16 ) | MUX_PA07B_ADC_AIN7 )
#define PORT_PA07B_ADC_AIN7          ( 1u << 7 )
#define PIN_PB00B_ADC_AIN8           32       /**< \brief ADC signal: AIN8 on PB00 mux B */
#define MUX_PB00B_ADC_AIN8           1
#define PINMUX_PB00B_ADC_AIN8        ( ( PIN_PB00B_ADC_AIN8 << 16 ) | MUX_PB00B_ADC_AIN8 )
#define PORT_PB00B_ADC_AIN8          ( 1u << 0 )
#define PIN_PB01B_ADC_AIN9           33       /**< \brief ADC signal: AIN9 on PB01 mux B */
#define MUX_PB01B_ADC_AIN9           1
#define PINMUX_PB01B_ADC_AIN9        ( ( PIN_PB01B_ADC_AIN9 << 16 ) | MUX_PB01B_ADC_AIN9 )
#define PORT_PB01B_ADC_AIN9          ( 1u << 1 )
#define PIN_PB02B_ADC_AIN10          34       /**< \brief ADC signal: AIN10 on PB02 mux B */
#define MUX_PB02B_ADC_AIN10          1
#define PINMUX_PB02B_ADC_AIN10       ( ( PIN_PB02B_ADC_AIN10 << 16 ) | MUX_PB02B_ADC_AIN10 )
#define PORT_PB02B_ADC_AIN10         ( 1u << 2 )
#define PIN_PB03B_ADC_AIN11          35       /**< \brief ADC signal: AIN11 on PB03 mux B */
#define MUX_PB03B_ADC_AIN11          1
#define PINMUX_PB03B_ADC_AIN11       ( ( PIN_PB03B_ADC_AIN11 << 16 ) | MUX_PB03B_ADC_AIN11 )
#define PORT_PB03B_ADC_AIN11         ( 1u << 3 )
#define PIN_PB04B_ADC_AIN12          36       /**< \brief ADC signal: AIN12 on PB04 mux B */
#define MUX_PB04B_ADC_AIN12          1
#define PINMUX_PB04B_ADC_AIN12       ( ( PIN_PB04B_ADC_AIN12 << 16 ) | MUX_PB04B_ADC_AIN12 )
#define PORT_PB04B_ADC_AIN12         ( 1u << 4 )
#define PIN_PB05B_ADC_AIN13          37       /**< \brief ADC signal: AIN13 on PB05 mux B */
#define MUX_PB05B_ADC_AIN13          1
#define PINMUX_PB05B_ADC_AIN13       ( ( PIN_PB05B_ADC_AIN13 << 16 ) | MUX_PB05B_ADC_AIN13 )
#define PORT_PB05B_ADC_AIN13         ( 1u << 5 )
#define PIN_PB06B_ADC_AIN14          38       /**< \brief ADC signal: AIN14 on PB06 mux B */
#define MUX_PB06B_ADC_AIN14          1
#define PINMUX_PB06B_ADC_AIN14       ( ( PIN_PB06B_ADC_AIN14 << 16 ) | MUX_PB06B_ADC_AIN14 )
#define PORT_PB06B_ADC_AIN14         ( 1u << 6 )
#define PIN_PB07B_ADC_AIN15          39       /**< \brief ADC signal: AIN15 on PB07 mux B */
#define MUX_PB07B_ADC_AIN15          1
#define PINMUX_PB07B_ADC_AIN15       ( ( PIN_PB07B_ADC_AIN15 << 16 ) | MUX_PB07B_ADC_AIN15 )
#define PORT_PB07B_ADC_AIN15         ( 1u << 7 )
#define PIN_PA08B_ADC_AIN16          8        /**< \brief ADC signal: AIN16 on PA08 mux B */
#define MUX_PA08B_ADC_AIN16          1
#define PINMUX_PA08B_ADC_AIN16       ( ( PIN_PA08B_ADC_AIN16 << 16 ) | MUX_PA08B_ADC_AIN16 )
#define PORT_PA08B_ADC_AIN16         ( 1u << 8 )
#define PIN_PA09B_ADC_AIN17          9        /**< \brief ADC signal: AIN17 on PA09 mux B */
#define MUX_PA09B_ADC_AIN17          1
#define PINMUX_PA09B_ADC_AIN17       ( ( PIN_PA09B_ADC_AIN17 << 16 ) | MUX_PA09B_ADC_AIN17 )
#define PORT_PA09B_ADC_AIN17         ( 1u << 9 )
#define PIN_PA10B_ADC_AIN18          10       /**< \brief ADC signal: AIN18 on PA10 mux B */
#define MUX_PA10B_ADC_AIN18          1
#define PINMUX_PA10B_ADC_AIN18       ( ( PIN_PA10B_ADC_AIN18 << 16 ) | MUX_PA10B_ADC_AIN18 )
#define PORT_PA10B_ADC_AIN18         ( 1u << 10 )
#define PIN_PA11B_ADC_AIN19          11       /**< \brief ADC signal: AIN19 on PA11 mux B */
#define MUX_PA11B_ADC_AIN19          1
#define PINMUX_PA11B_ADC_AIN19       ( ( PIN_PA11B_ADC_AIN19 << 16 ) | MUX_PA11B_ADC_AIN19 )
#define PORT_PA11B_ADC_AIN19         ( 1u << 11 )
#define PIN_PA04B_ADC_VREFP          4        /**< \brief ADC signal: VREFP on PA04 mux B */
#define MUX_PA04B_ADC_VREFP          1
#define PINMUX_PA04B_ADC_VREFP       ( ( PIN_PA04B_ADC_VREFP << 16 ) | MUX_PA04B_ADC_VREFP )
#define PORT_PA04B_ADC_VREFP         ( 1u << 4 )
/* ========== PORT definition for AC peripheral ========== */
#define PIN_PA04B_AC_AIN0            4        /**< \brief AC signal: AIN0 on PA04 mux B */
#define MUX_PA04B_AC_AIN0            1
#define PINMUX_PA04B_AC_AIN0         ( ( PIN_PA04B_AC_AIN0 << 16 ) | MUX_PA04B_AC_AIN0 )
#define PORT_PA04B_AC_AIN0           ( 1u << 4 )
#define PIN_PA05B_AC_AIN1            5        /**< \brief AC signal: AIN1 on PA05 mux B */
#define MUX_PA05B_AC_AIN1            1
#define PINMUX_PA05B_AC_AIN1         ( ( PIN_PA05B_AC_AIN1 << 16 ) | MUX_PA05B_AC_AIN1 )
#define PORT_PA05B_AC_AIN1           ( 1u << 5 )
#define PIN_PA06B_AC_AIN2            6        /**< \brief AC signal: AIN2 on PA06 mux B */
#define MUX_PA06B_AC_AIN2            1
#define PINMUX_PA06B_AC_AIN2         ( ( PIN_PA06B_AC_AIN2 << 16 ) | MUX_PA06B_AC_AIN2 )
#define PORT_PA06B_AC_AIN2           ( 1u << 6 )
#define PIN_PA07B_AC_AIN3            7        /**< \brief AC signal: AIN3 on PA07 mux B */
#define MUX_PA07B_AC_AIN3            1
#define PINMUX_PA07B_AC_AIN3         ( ( PIN_PA07B_AC_AIN3 << 16 ) | MUX_PA07B_AC_AIN3 )
#define PORT_PA07B_AC_AIN3           ( 1u << 7 )
#define PIN_PA12H_AC_CMP0            12       /**< \brief AC signal: CMP0 on PA12 mux H */
#define MUX_PA12H_AC_CMP0            7
#define PINMUX_PA12H_AC_CMP0         ( ( PIN_PA12H_AC_CMP0 << 16 ) | MUX_PA12H_AC_CMP0 )
#define PORT_PA12H_AC_CMP0           ( 1u << 12 )
#define PIN_PA18H_AC_CMP0            18       /**< \brief AC signal: CMP0 on PA18 mux H */
#define MUX_PA18H_AC_CMP0            7
#define PINMUX_PA18H_AC_CMP0         ( ( PIN_PA18H_AC_CMP0 << 16 ) | MUX_PA18H_AC_CMP0 )
#define PORT_PA18H_AC_CMP0           ( 1u << 18 )
#define PIN_PA13H_AC_CMP1            13       /**< \brief AC signal: CMP1 on PA13 mux H */
#define MUX_PA13H_AC_CMP1            7
#define PINMUX_PA13H_AC_CMP1         ( ( PIN_PA13H_AC_CMP1 << 16 ) | MUX_PA13H_AC_CMP1 )
#define PORT_PA13H_AC_CMP1           ( 1u << 13 )
#define PIN_PA19H_AC_CMP1            19       /**< \brief AC signal: CMP1 on PA19 mux H */
#define MUX_PA19H_AC_CMP1            7
#define PINMUX_PA19H_AC_CMP1         ( ( PIN_PA19H_AC_CMP1 << 16 ) | MUX_PA19H_AC_CMP1 )
#define PORT_PA19H_AC_CMP1           ( 1u << 19 )
/* ========== PORT definition for DAC peripheral ========== */
#define PIN_PA02B_DAC_VOUT           2        /**< \brief DAC signal: VOUT on PA02 mux B */
#define MUX_PA02B_DAC_VOUT           1
#define PINMUX_PA02B_DAC_VOUT        ( ( PIN_PA02B_DAC_VOUT << 16 ) | MUX_PA02B_DAC_VOUT )
#define PORT_PA02B_DAC_VOUT          ( 1u << 2 )
#define PIN_PA03B_DAC_VREFP          3        /**< \brief DAC signal: VREFP on PA03 mux B */
#define MUX_PA03B_DAC_VREFP          1
#define PINMUX_PA03B_DAC_VREFP       ( ( PIN_PA03B_DAC_VREFP << 16 ) | MUX_PA03B_DAC_VREFP )
#define PORT_PA03B_DAC_VREFP         ( 1u << 3 )

#endif /* _SAMD20J18_PIO_ */
